import React, { Component } from "react";
import { Row, Col } from "antd";

export class Flash extends Component {
  render() {
    return (
      <Row style={{background: "white" }}>
        <Col span={6}>
          女装 / 内衣 / 家居
          <br />
          女鞋 / 男鞋 / 箱包
          <br />
          母婴 / 童装 / 玩具
          <br />
          男装 / 运动户外
          <br />
          美妆 / 彩妆 / 个护
          <br />
          手机 / 数码 / 企业
          <br />
          大家电 / 生活电器
          <br />
          零食 / 生鲜 / 茶酒
          <br />
          厨具 / 收纳 / 清洁
          <br />
          家纺 / 家饰 / 鲜花
          <br />
          图书音像 / 文具
          <br />
          医药保健 / 进口
          <br />
          汽车 / 二手车 / 用品
          <br />
          房产 / 装修家具 / 建材
          <br />
          手表 / 眼镜 / 珠宝饰品 女装 / 内衣 / 家居
          <br />
          女鞋 / 男鞋 / 箱包
          <br />
          母婴 / 童装 / 玩具
          <br />
          男装 / 运动户外
          <br />
          美妆 / 彩妆 / 个护
          <br />
          手机 / 数码 / 企业
          <br />
          大家电 / 生活电器
          <br />
          零食 / 生鲜 / 茶酒
          <br />
          厨具 / 收纳 / 清洁
          <br />
          家纺 / 家饰 / 鲜花
          <br />
          图书音像 / 文具
          <br />
          医药保健 / 进口
          <br />
          汽车 / 二手车 / 用品
          <br />
          房产 / 装修家具 / 建材
          <br />
          手表 / 眼镜 / 珠宝饰品 女装 / 内衣 / 家居
          <br />
          女鞋 / 男鞋 / 箱包
          <br />
          母婴 / 童装 / 玩具
          <br />
          男装 / 运动户外
          <br />
          美妆 / 彩妆 / 个护
          <br />
          手机 / 数码 / 企业
          <br />
          大家电 / 生活电器
          <br />
          零食 / 生鲜 / 茶酒
          <br />
          厨具 / 收纳 / 清洁
          <br />
          家纺 / 家饰 / 鲜花
          <br />
          图书音像 / 文具
          <br />
          医药保健 / 进口
          <br />
          汽车 / 二手车 / 用品
          <br />
          房产 / 装修家具 / 建材
          <br />
          手表 / 眼镜 / 珠宝饰品 女装 / 内衣 / 家居
          <br />
          女鞋 / 男鞋 / 箱包
          <br />
          母婴 / 童装 / 玩具
          <br />
          男装 / 运动户外
          <br />
          美妆 / 彩妆 / 个护
          <br />
          手机 / 数码 / 企业
          <br />
          大家电 / 生活电器
          <br />
          零食 / 生鲜 / 茶酒
          <br />
          厨具 / 收纳 / 清洁
          <br />
          家纺 / 家饰 / 鲜花
          <br />
          图书音像 / 文具
          <br />
          医药保健 / 进口
          <br />
          汽车 / 二手车 / 用品
          <br />
          房产 / 装修家具 / 建材
          <br />
          手表 / 眼镜 / 珠宝饰品
        </Col>
        <Col span={12}>Search 搜索框</Col>
        <Col span={6}>二维码</Col>
      </Row>
    );
  }
}

export default Flash;
